seabears/Stm32_Test/Bootloader_DFU_Min/Core/Src/main.c
#include "stm32f1xx.h"

/*
 * STM32F103 최소 USB DFU 부트로더.
 *
 * 플래시 배치:
 *   0x08000000 ~ 0x08001FFF : 이 부트로더, 목표 크기 8 KiB
 *   0x08002000 ~ 끝         : USB DFU로 기록되는 사용자 앱
 *
 * 전체 동작:
 *   1. 클럭, SysTick, USB 장치 주변장치를 직접 초기화한다.
 *   2. 리셋 직후 짧은 시간 동안 USB DFU 장치 1EAF:0003으로 나타난다.
 *   3. dfu-util 업로드가 들어오면 앱 영역만 지우고 기록한다.
 *   4. 업로드가 없고 기존 앱이 유효하면 앱 벡터 테이블로 점프한다.
 */

/* 사용자 앱 시작 주소. 앱 링커 스크립트도 반드시 이 주소에 맞아야 한다. */
#define APP_ADDRESS        0x08002000U
/* STM32F103C8 128 KiB 플래시의 끝 주소. 기록 범위 검사에 사용한다. */
#define FLASH_END_ADDRESS  0x08020000U
/* 앱 벡터 테이블의 초기 SP가 SRAM 안에 있는지 검사하기 위한 범위. */
#define SRAM_START         0x20000000U
#define SRAM_END           0x20005000U
/* DFU 활동이 없으면 이 시간 뒤 앱으로 점프한다. */
#define BOOT_TIMEOUT_MS    1000U
/* 디버깅용. 1로 바꾸면 앱으로 점프하지 않고 DFU 모드에 계속 머문다. */
#define DEBUG_STAY_IN_DFU  0U

/* Maple DFU 계열과 맞춘 VID/PID. dfu-util -d 1EAF:0003으로 찾는다. */
#define USB_VID            0x1EAFU
#define USB_PID            0x0003U
/* STM32F103 USB full-speed EP0의 일반적인 최대 패킷 크기. */
#define EP0_SIZE           64U
/* dfu-util이 한 번에 내려보내는 DFU 데이터 블록 크기. */
#define DFU_XFER_SIZE      1024U

/* STM32F103 USB PMA는 16비트 단위이며 워드 간격이 2칸처럼 보인다. */
#define PMA_ACCESS         2U
/* EP0 IN/OUT 버퍼를 USB PMA 안에 배치하는 주소. */
#define EP0_TX_ADDR        0x40U
#define EP0_RX_ADDR        0x80U

/* RX count register에서 32바이트 블록 모드를 표시하는 비트. */
#define USB_CNTRX_BLSIZE   0x8000U
/* STM32F103 중밀도 플래시는 1 KiB 페이지 단위로 erase한다. */
#define FLASH_PAGE_SIZE    1024U

/* USB 표준 control request 번호. enumeration 중 host가 EP0로 보낸다. */
#define USB_REQ_GET_STATUS        0x00U
#define USB_REQ_CLEAR_FEATURE     0x01U
#define USB_REQ_SET_ADDRESS       0x05U
#define USB_REQ_GET_DESCRIPTOR    0x06U
#define USB_REQ_GET_CONFIGURATION 0x08U
#define USB_REQ_SET_CONFIGURATION 0x09U
#define USB_REQ_GET_INTERFACE     0x0AU
#define USB_REQ_SET_INTERFACE     0x0BU

/* USB descriptor type 번호. GET_DESCRIPTOR 요청의 wValue 상위 바이트에 들어온다. */
#define USB_DESC_DEVICE           0x01U
#define USB_DESC_CONFIGURATION    0x02U
#define USB_DESC_STRING           0x03U

/* USB DFU class-specific request 번호. dfu-util과의 실제 업데이트 대화에 쓰인다. */
#define DFU_DETACH                0x00U
#define DFU_DNLOAD                0x01U
#define DFU_UPLOAD                0x02U
#define DFU_GETSTATUS             0x03U
#define DFU_CLRSTATUS             0x04U
#define DFU_GETSTATE              0x05U
#define DFU_ABORT                 0x06U

/* DFU 1.1 상태값. GETSTATUS/GETSTATE 응답에 그대로 실어 보낸다. */
#define DFU_STATE_DFU_IDLE        2U
#define DFU_STATE_DNLOAD_SYNC     3U
#define DFU_STATE_DNBUSY          4U
#define DFU_STATE_DNLOAD_IDLE     5U
#define DFU_STATE_MANIFEST_SYNC   6U
#define DFU_STATE_MANIFEST        7U
#define DFU_STATE_MANIFEST_RESET  8U
#define DFU_STATE_ERROR           10U

/* DFU status code. 주소 오류와 플래시 쓰기 오류만 최소 구현한다. */
#define DFU_STATUS_OK             0x00U
#define DFU_STATUS_ERR_ADDRESS    0x08U
#define DFU_STATUS_ERR_WRITE      0x03U

/* ST DfuSe 확장 명령. block 0 payload의 첫 바이트로 구분한다. */
#define DFUSE_CMD_SET_ADDRESS     0x21U
#define DFUSE_CMD_ERASE           0x41U

/* EP0 제어 전송과 분리하여 메인 루프에서 실행할 플래시 작업 종류. */
#define DFU_OP_NONE               0U
#define DFU_OP_SET_ADDRESS        1U
#define DFU_OP_ERASE              2U
#define DFU_OP_WRITE              3U
/* 호스트가 다음 GETSTATUS를 보내기 전에 기다릴 권장 시간(ms). */
#define DFU_POLL_TIMEOUT_MS       250U

/* 앱 Reset_Handler로 점프하기 위한 함수 포인터 타입. */
typedef void (*entry_fn_t)(void);

/* USB SETUP 패킷 8바이트 구조. EP0 SETUP 수신 시 PMA에서 이 형태로 읽는다. */
typedef struct
{
  uint8_t bmRequestType;
  uint8_t bRequest;
  uint16_t wValue;
  uint16_t wIndex;
  uint16_t wLength;
} setup_pkt_t;

/* SysTick에서 1 ms마다 증가하는 간단한 시간 기준. */
static volatile uint32_t g_ms;
/* 가장 최근에 받은 USB SETUP 패킷. */
static setup_pkt_t g_setup;
/* EP0 OUT으로 들어온 DFU 데이터 블록을 임시로 모으는 버퍼. */
static uint8_t g_ep0_out[DFU_XFER_SIZE];
/* EP0 IN 전송이 64바이트를 넘을 때 남은 데이터 위치와 길이. */
static const uint8_t *g_tx_ptr;
static uint16_t g_tx_len;
/* SET_ADDRESS는 상태 단계가 끝난 뒤 적용해야 하므로 잠시 보관한다. */
static uint8_t g_pending_addr;
/* SET_CONFIGURATION으로 받은 현재 configuration 값. */
static uint8_t g_configured;
/* 현재 EP0 OUT 데이터 단계를 기다리는 중인지 표시한다. */
static uint8_t g_expect_out;
/* 이번 EP0 OUT 전송에서 받아야 하는 총 길이와 현재 누적 길이. */
static uint16_t g_ep0_expected;
static uint16_t g_ep0_received;
/* DFU 상태 머신의 현재 상태와 오류 코드. */
static uint8_t g_dfu_state = DFU_STATE_DFU_IDLE;
static uint8_t g_dfu_status = DFU_STATUS_OK;
/*
 * USB 인터럽트에서는 플래시를 직접 건드리지 않고 작업 정보만 예약한다.
 * 실제 erase/write는 메인 루프가 실행하여 EP0 응답 지연과 PIPE 오류를 막는다.
 */
static uint8_t g_pending_dfu_op;
static uint8_t g_pending_dfu_ready;
static uint16_t g_pending_dfu_len;
static uint32_t g_pending_dfu_addr;
/* DFU manifest/leave 이후 리셋을 예약하기 위한 플래그와 시각. */
static uint8_t g_leave_requested;
static uint32_t g_leave_at;
/* DfuSe SET_ADDRESS 명령으로 설정되는 현재 플래시 기록 기준 주소. */
static uint32_t g_dfu_address = APP_ADDRESS;
/* DFU 다운로드 활동이 한 번이라도 있었는지 표시한다. 앱 자동 점프 억제에 사용한다. */
static uint32_t g_activity_seen;

/* USB device descriptor. PC가 처음 장치를 인식할 때 읽는다. */
static const uint8_t dev_desc[] =
{
  18, USB_DESC_DEVICE, 0x00, 0x02, 0x00, 0x00, 0x00, EP0_SIZE,
  (uint8_t)USB_VID, (uint8_t)(USB_VID >> 8),
  (uint8_t)USB_PID, (uint8_t)(USB_PID >> 8),
  0x00, 0x02, 0, 0, 0, 1
};

/* USB configuration/interface/DFU functional descriptor를 한 번에 담는다. */
static const uint8_t cfg_desc[] =
{
  9, USB_DESC_CONFIGURATION, 27, 0, 1, 1, 0, 0x80, 50,
  9, 4, 0, 0, 0, 0xFE, 0x01, 0x02, 4,
  9, 0x21, 0x0B, 0xFF, 0x00,
  (uint8_t)DFU_XFER_SIZE, (uint8_t)(DFU_XFER_SIZE >> 8), 0x10, 0x01
};

/* 문자열 descriptor들. str4는 DfuSe 메모리 맵 문자열이다. */
static const uint8_t str0[] = {4, USB_DESC_STRING, 0x09, 0x04};
static const uint8_t str1[] = {18, USB_DESC_STRING, 'h',0,'a',0,'e',0,'w',0,'o',0,'o',0,'n',0,'g',0};
static const uint8_t str2[] = {38, USB_DESC_STRING, 'M',0,'i',0,'n',0,' ',0,'D',0,'F',0,'U',0,' ',0,'B',0,'o',0,'o',0,'t',0,'l',0,'o',0,'a',0,'d',0,'e',0,'r',0};
static const uint8_t str3[] = {26, USB_DESC_STRING, '0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'0',0,'1',0};
static const uint8_t str4[] =
{
  76, USB_DESC_STRING,
  '@',0,'I',0,'n',0,'t',0,'e',0,'r',0,'n',0,'a',0,'l',0,' ',0,'F',0,'l',0,'a',0,'s',0,'h',0,' ',0,
  '/',0,'0',0,'x',0,'0',0,'8',0,'0',0,'0',0,'2',0,'0',0,'0',0,'0',0,'/',0,
  '1',0,'2',0,'0',0,'*',0,'0',0,'0',0,'1',0,'K',0,'g',0
};

