seabears/Stm32_Test/Bootloader_DFU_Min/Core/Src/main.c
static void clock_init(void);
static void systick_init(void);
static void usb_gpio_disconnect(void);
static void usb_init(void);
static void usb_reset(void);
static void usb_handle_ctr(void);
static void usb_setup(void);
static void usb_rx_out(void);
static void usb_tx_done(void);
static void ep0_send(const uint8_t *data, uint16_t len);
static void ep0_send_zlp(void);
static void ep0_stall(void);
static void ep0_rx_valid(void);
static void ep0_tx_status(uint16_t status);
static void ep0_rx_status(uint16_t status);
static void pma_write(uint16_t pma_addr, const uint8_t *src, uint16_t len);
static void pma_read(uint16_t pma_addr, uint8_t *dst, uint16_t len);
static void pma_set_u16(uint16_t offset, uint16_t value);
static uint16_t pma_get_u16(uint16_t offset);
static void handle_standard(void);
static void handle_dfu(void);
static void dfu_process_dnload(const uint8_t *buf, uint16_t len);
static void dfu_run_pending(void);
static void flash_unlock(void);
static void flash_lock(void);
static uint8_t flash_erase_page(uint32_t addr);
static uint8_t flash_write(uint32_t addr, const uint8_t *src, uint16_t len);
static uint8_t address_allowed(uint32_t addr, uint32_t len);
static void flash_wait(void);
static void flash_clear_flags(void);
static uint8_t app_valid(void);
static void jump_app(void);
static uint16_t min16(uint16_t a, uint16_t b);
static uint32_t rd32(const uint8_t *p);

void SystemInit(void) {}
void __libc_init_array(void) {}

int main(void)
{
  /* USB는 48 MHz 클럭이 정확해야 하므로 먼저 72 MHz 시스템 클럭을 만든다. */
  clock_init();
  /* 1 ms 타이머를 만들어 부트 타임아웃과 leave 리셋 지연에 사용한다. */
  systick_init();
  /* D+를 잠깐 low로 당겨 PC가 USB 재연결로 인식하게 만든다. */
  usb_gpio_disconnect();
  /* STM32F103 USB device peripheral과 EP0 interrupt를 켠다. */
  usb_init();

  /*
   * 이 루프는 별도 scheduler 없이 두 가지 조건만 계속 감시한다.
   * - DFU 활동이 없으면 일정 시간 뒤 앱으로 점프
   * - DFU leave/reset 요청이 들어오면 약간 기다린 뒤 MCU 리셋
   */
  while (1)
  {
    /*
     * GETSTATUS에서 DNBUSY를 먼저 응답한 뒤 예약된 플래시 작업을 실행한다.
     * 이렇게 해야 제어 전송 도중 FLASH가 CPU를 멈추게 해도 호스트가 PIPE 오류를 내지 않는다.
     */
    if ((g_dfu_state == DFU_STATE_DNBUSY) &&
        (g_pending_dfu_op != DFU_OP_NONE) &&
        (g_pending_dfu_ready != 0U))
    {
      dfu_run_pending();
    }

    /* 디버그 고정 모드가 아니고, DFU 활동이 없고, 1초가 지났고, 앱이 유효하면 실행한다. */
    if ((DEBUG_STAY_IN_DFU == 0U) && (g_activity_seen == 0U) && (g_ms > BOOT_TIMEOUT_MS) && app_valid())
    {
      jump_app();
    }
    /* dfu-util이 :leave를 사용했을 때는 status 응답 후 약간 기다렸다가 리셋한다. */
    if ((g_leave_requested != 0U) && ((g_ms - g_leave_at) > 100U))
    {
      NVIC_SystemReset();
    }
  }
}

void SysTick_Handler(void)
{
  /* 72 MHz / 72000 = 1 kHz이므로 1 ms마다 증가한다. */
  g_ms++;
}

void USB_LP_CAN1_RX0_IRQHandler(void)
{
  uint16_t istr = USB->ISTR;

  /* USB reset은 enumeration 시작 시 PC가 보낸다. EP0 상태를 처음부터 다시 잡는다. */
  if ((istr & USB_ISTR_RESET) != 0U)
  {
    USB->ISTR = (uint16_t)~USB_ISTR_RESET;
    usb_reset();
  }

  /* CTR은 endpoint 전송 완료 이벤트다. pending 이벤트가 없을 때까지 처리한다. */
  while ((USB->ISTR & USB_ISTR_CTR) != 0U)
  {
    usb_handle_ctr();
  }
}

static void clock_init(void)
{
  /* 플래시 prefetch와 wait state를 72 MHz 동작에 맞춘다. */
  FLASH->ACR |= FLASH_ACR_PRFTBE; // prefetch enable (다음 명령어를 미리 읽어두는 기능)
  FLASH->ACR &= ~FLASH_ACR_LATENCY;
  FLASH->ACR |= FLASH_ACR_LATENCY_2;  // 2 wait state (72 MHz에서 플래시 읽기 지연을 맞추기 위해 필요)

  /* 외부 8 MHz HSE를 켠다. Blue Pill 계열 보드는 보통 8 MHz 크리스털을 쓴다. */
  RCC->CR |= RCC_CR_HSEON;
  while ((RCC->CR & RCC_CR_HSERDY) == 0U) {}

  /* HSE x9 = 72 MHz, APB1은 36 MHz, USB는 PLL/1.5 = 48 MHz가 되게 설정한다. */
  RCC->CFGR = 0U;
  RCC->CFGR |= RCC_CFGR_PPRE1_DIV2 | RCC_CFGR_PLLSRC | RCC_CFGR_PLLMULL9;
  RCC->CFGR &= ~RCC_CFGR_USBPRE;

  /* PLL을 켜고 시스템 클럭 소스로 선택한다. */
  RCC->CR |= RCC_CR_PLLON;
  while ((RCC->CR & RCC_CR_PLLRDY) == 0U) {}

  RCC->CFGR |= RCC_CFGR_SW_PLL; // PLL을 시스템 클럭으로 선택
  while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) {} // 실제 사용중인 클럭소스가 PLL인지 확인
}

static void systick_init(void)
{
  /* 72 MHz에서 72000 tick마다 interrupt를 걸면 1 ms 주기가 된다. */
  SysTick->LOAD = 72000U - 1U;
  SysTick->VAL = 0U;
  SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_ENABLE_Msk;
}

static void usb_gpio_disconnect(void)
{
  /*
   * 많은 STM32F103 보드는 USB D+에 pull-up이 고정되어 있다.
   * PA12(D+)를 잠깐 output low로 만들어 PC가 물리적인 disconnect/reconnect를 본 것처럼 만든다.
   */
  RCC->APB2ENR |= RCC_APB2ENR_IOPAEN; // GPIOA clock enable
  GPIOA->CRH &= ~(GPIO_CRH_MODE12 | GPIO_CRH_CNF12);  // 설정비트 초기화
  GPIOA->CRH |= GPIO_CRH_MODE12_1;  // PA12 output 설정
  GPIOA->BRR = GPIO_BRR_BR12; // PA12 Low 출력
  for (volatile uint32_t i = 0; i < 720000U; i++) {}  // 72MHz기준, 약 10 ms
  GPIOA->CRH &= ~(GPIO_CRH_MODE12 | GPIO_CRH_CNF12);
  GPIOA->CRH |= GPIO_CRH_CNF12_0;
}

static void usb_init(void)
{
  /* USB peripheral 클럭을 켜고 force reset으로 내부 상태를 초기화한다. */
  RCC->APB1ENR |= RCC_APB1ENR_USBEN;
  USB->CNTR = USB_CNTR_FRES;
  USB->CNTR = 0U;
  USB->ISTR = 0U;
  USB->BTABLE = 0U;
  /* USB reset 이벤트와 endpoint CTR 이벤트만 interrupt로 받는다. */
  USB->CNTR = USB_CNTR_RESETM | USB_CNTR_CTRM;
  USB->DADDR = USB_DADDR_EF;
  NVIC_SetPriority(USB_LP_CAN1_RX0_IRQn, 0U);
  NVIC_EnableIRQ(USB_LP_CAN1_RX0_IRQn);
}

static void usb_reset(void)
{
  /* BTABLE은 PMA 시작 주소 0에 둔다. EP0 descriptor 4개 word를 직접 설정한다. */
  USB->BTABLE = 0U;
  /* EP0 TX buffer address, TX count, RX buffer address, RX count 설정. */
  pma_set_u16(0U, EP0_TX_ADDR);
  pma_set_u16(2U, 0U);
  pma_set_u16(4U, EP0_RX_ADDR);
  /* 64바이트 RX 버퍼 설정. 0x8400은 STM32 USB PMA count 형식이다. */
  pma_set_u16(6U, 0x8400U);

  /* EP0를 control endpoint로 열고, 먼저 OUT/SETUP을 받을 준비를 한다. */
  USB->EP0R = USB_EP_CONTROL | USB_EP_CTR_RX | USB_EP_CTR_TX;
  ep0_tx_status(USB_EP_TX_NAK);
  ep0_rx_status(USB_EP_RX_VALID);

  /* USB 주소와 EP0/DFU 상태를 enumeration 시작 상태로 되돌린다. */
  USB->DADDR = USB_DADDR_EF;
  g_pending_addr = 0U;
  g_configured = 0U;
  g_expect_out = 0U;
  g_tx_len = 0U;
  g_dfu_state = DFU_STATE_DFU_IDLE;
  g_dfu_status = DFU_STATUS_OK;
  g_pending_dfu_op = DFU_OP_NONE;
  g_pending_dfu_ready = 0U;
}

static void usb_handle_ctr(void)
{
  uint16_t ep = USB->ISTR & USB_ISTR_EP_ID;
  uint16_t epr;

  /* 이 부트로더는 EP0만 구현한다. 다른 endpoint 이벤트는 무시한다. */
  if (ep != 0U)
  {
    USB->ISTR = (uint16_t)~USB_ISTR_CTR;
    return;
  }

  epr = USB->EP0R;
  if ((epr & USB_EP_CTR_RX) != 0U)
  {
    /* RX 완료 플래그를 지우되 TX 완료 플래그는 보존한다. */
    USB->EP0R = (uint16_t)((epr & (0x7FFFU & USB_EPREG_MASK)) | USB_EP_CTR_TX);
    if ((epr & USB_EP_SETUP) != 0U)
    {
      /* SETUP 단계: 표준 USB 요청 또는 DFU class 요청을 해석한다. */
      usb_setup();
    }
    else
    {
      /* OUT 데이터 단계: DFU 다운로드 payload를 이어 받는다. */
      usb_rx_out();
    }
  }

  epr = USB->EP0R;
  if ((epr & USB_EP_CTR_TX) != 0U)
  {
    /* TX 완료 플래그를 지우되 RX 완료 플래그는 보존한다. */
    USB->EP0R = (uint16_t)((epr & (0xFF7FU & USB_EPREG_MASK)) | USB_EP_CTR_RX);
    usb_tx_done();
  }
}

