seabears/Stm32_Test/Bootloader_DFU_Min/Core/Src/main.c
static void usb_setup(void)
{
  /* EP0 RX PMA에는 SETUP 패킷 8바이트가 들어 있다. */
  pma_read(EP0_RX_ADDR, (uint8_t *)&g_setup, 8U);
  g_tx_ptr = 0;
  g_tx_len = 0U;
  g_expect_out = 0U;
  ep0_tx_status(USB_EP_TX_NAK);

  /* bmRequestType type 필드가 class(0x20)이면 DFU 요청으로 본다. */
  if ((g_setup.bmRequestType & 0x60U) == 0x20U)
  {
    handle_dfu();
  }
  else
  {
    handle_standard();
  }
}

static void handle_standard(void)
{
  /* GET_DESCRIPTOR의 상위 바이트는 descriptor type, 하위 바이트는 index다. */
  uint8_t dtype = (uint8_t)(g_setup.wValue >> 8);
  uint8_t dindex = (uint8_t)g_setup.wValue;
  static uint8_t two[2];
  static uint8_t one[1];
  const uint8_t *p = 0;
  uint16_t len = 0U;

  switch (g_setup.bRequest)
  {
    case USB_REQ_GET_DESCRIPTOR:
      /* PC가 장치/구성/문자열 descriptor를 요청하면 준비된 배열을 돌려준다. */
      if (dtype == USB_DESC_DEVICE) { p = dev_desc; len = sizeof(dev_desc); }
      else if (dtype == USB_DESC_CONFIGURATION) { p = cfg_desc; len = sizeof(cfg_desc); }
      else if (dtype == USB_DESC_STRING)
      {
        if (dindex == 0U) { p = str0; len = sizeof(str0); }
        else if (dindex == 1U) { p = str1; len = sizeof(str1); }
        else if (dindex == 2U) { p = str2; len = sizeof(str2); }
        else if (dindex == 3U) { p = str3; len = sizeof(str3); }
        else if (dindex == 4U) { p = str4; len = sizeof(str4); }
      }
      if (p != 0) { ep0_send(p, min16(len, g_setup.wLength)); }
      else { ep0_stall(); }
      break;

    case USB_REQ_SET_ADDRESS:
      /*
       * USB 주소는 status stage가 끝난 뒤 적용해야 한다.
       * 그래서 여기서는 g_pending_addr에 저장하고 ZLP 응답 후 usb_tx_done에서 적용한다.
       */
      g_pending_addr = (uint8_t)(g_setup.wValue & 0x7FU);
      ep0_send_zlp();
      break;

    case USB_REQ_SET_CONFIGURATION:
      /* DFU interface 하나뿐이므로 configuration 값만 기억하고 성공 응답한다. */
      g_configured = (uint8_t)g_setup.wValue;
      ep0_send_zlp();
      break;

    case USB_REQ_GET_CONFIGURATION:
      /* 현재 configuration 값을 1바이트로 반환한다. */
      one[0] = g_configured;
      ep0_send(one, 1U);
      break;

    case USB_REQ_GET_INTERFACE:
      /* alternate setting은 0 하나만 사용한다. */
      one[0] = 0U;
      ep0_send(one, 1U);
      break;

    case USB_REQ_GET_STATUS:
      /* self-powered/remote-wakeup 같은 상태 비트를 모두 0으로 응답한다. */
      two[0] = 0U; two[1] = 0U;
      ep0_send(two, 2U);
      break;

    case USB_REQ_SET_INTERFACE:
    case USB_REQ_CLEAR_FEATURE:
      /* 이 최소 구현에서는 별도 동작 없이 성공 처리한다. */
      ep0_send_zlp();
      break;

    default:
      /* 지원하지 않는 표준 요청은 STALL로 거절한다. */
      ep0_stall();
      break;
  }
}

static void handle_dfu(void)
{
  static uint8_t resp[6];

  g_activity_seen = 1U;

  switch (g_setup.bRequest)
  {
    case DFU_DNLOAD:
      /*
       * dfu-util이 펌웨어를 내려보낼 때 사용하는 핵심 요청.
       * wLength가 0이면 다운로드 종료(manifest), 0보다 크면 OUT data stage가 이어진다.
       */
      if (g_setup.wLength == 0U)
      {
        /* 0-length DNLOAD는 전송 종료 신호다. 이후 GETSTATUS에서 reset 상태로 넘어간다. */
        g_dfu_state = DFU_STATE_MANIFEST_SYNC;
        ep0_send_zlp();
      }
      else if (g_setup.wLength <= DFU_XFER_SIZE)
      {
        /* 실제 데이터는 다음 OUT transaction으로 들어오므로 받을 길이를 기록해둔다. */
        g_expect_out = 1U;
        g_ep0_expected = g_setup.wLength;
        g_ep0_received = 0U;
        ep0_rx_valid();
      }
      else
      {
        /* 이 부트로더가 받도록 정한 1024바이트보다 큰 블록은 거절한다. */
        ep0_stall();
      }
      break;

    case DFU_GETSTATUS:
    {
      /*
       * DNLOAD 수신 직후에는 아직 플래시 작업을 실행하지 않는다.
       * 먼저 DNBUSY와 poll timeout을 응답하고, 메인 루프가 작업을 끝낸 뒤 DNLOAD_IDLE을 반환한다.
       */
      uint8_t response_state = g_dfu_state;

      if (g_dfu_state == DFU_STATE_DNLOAD_SYNC)
      {
        if (g_pending_dfu_op != DFU_OP_NONE)
        {
          response_state = DFU_STATE_DNBUSY;
          g_dfu_state = DFU_STATE_DNBUSY;
          g_pending_dfu_ready = 0U;
        }
        else
        {
          g_dfu_state = DFU_STATE_DNLOAD_IDLE;
          response_state = g_dfu_state;
        }
      }
      else if (g_dfu_state == DFU_STATE_DNBUSY)
      {
        response_state = DFU_STATE_DNBUSY;
      }
      else if (g_dfu_state == DFU_STATE_MANIFEST_SYNC)
      {
        /* 다운로드가 끝났으므로 host에 reset 예정 상태를 알리고 실제 reset을 예약한다. */
        g_dfu_state = DFU_STATE_MANIFEST_RESET;
        response_state = g_dfu_state;
        g_leave_at = g_ms;
        g_leave_requested = 1U;
      }

      /* DFU GETSTATUS 응답: status 1바이트, poll timeout 3바이트, state 1바이트, iString 1바이트. */
      resp[0] = g_dfu_status;
      resp[1] = DFU_POLL_TIMEOUT_MS; resp[2] = 0U; resp[3] = 0U;
      resp[4] = response_state;
      resp[5] = 0U;
      ep0_send(resp, 6U);
      break;
    }

    case DFU_GETSTATE:
      /* 현재 DFU 상태만 1바이트로 반환한다. */
      resp[0] = g_dfu_state;
      ep0_send(resp, 1U);
      break;

    case DFU_CLRSTATUS:
    case DFU_ABORT:
      /* 오류 상태를 지우거나 현재 다운로드를 중단하고 idle로 돌아간다. */
      g_dfu_status = DFU_STATUS_OK;
      g_dfu_state = DFU_STATE_DFU_IDLE;
      g_pending_dfu_op = DFU_OP_NONE;
      g_pending_dfu_ready = 0U;
      ep0_send_zlp();
      break;

    case DFU_DETACH:
      /* runtime DFU detach는 사용하지 않지만 성공 응답만 해서 host를 막지 않는다. */
      ep0_send_zlp();
      break;

    default:
      /* UPLOAD 등 지원하지 않는 DFU 요청은 STALL 처리한다. */
      ep0_stall();
      break;
  }
}

static void usb_rx_out(void)
{
  /* EP0 RX count register에서 이번 OUT packet 길이만 꺼낸다. */
  uint16_t len = pma_get_u16(6U) & 0x03FFU;

  /*
   * Control IN 전송의 마지막 단계는 host가 보내는 zero-length OUT packet이다.
   * 이 packet까지 정상 수신한 뒤에만 예약된 플래시 작업의 실행을 허용한다.
   */
  if ((g_expect_out == 0U) && (len == 0U))
  {
    if ((g_dfu_state == DFU_STATE_DNBUSY) && (g_pending_dfu_op != DFU_OP_NONE))
    {
      g_pending_dfu_ready = 1U;
    }
    ep0_rx_valid();
    return;
  }

  /*
   * DFU_DNLOAD가 먼저 와서 OUT data stage를 기대하는 상태여야 한다.
   * EP0 packet은 최대 64바이트이므로 여러 packet을 모아 DFU_XFER_SIZE 블록을 만든다.
   */
  if ((g_expect_out != 0U) && (len <= EP0_SIZE) && ((g_ep0_received + len) <= DFU_XFER_SIZE))
  {
    pma_read(EP0_RX_ADDR, &g_ep0_out[g_ep0_received], len);
    g_ep0_received += len;

    if (g_ep0_received >= g_ep0_expected)
    {
      /* 이번 DFU block을 모두 받았으므로 DfuSe 명령 또는 플래시 데이터로 처리한다. */
      g_expect_out = 0U;
      dfu_process_dnload(g_ep0_out, g_ep0_received);
      ep0_send_zlp();
    }
    else
    {
      /* 아직 block이 끝나지 않았으므로 다음 OUT packet을 계속 받는다. */
      ep0_rx_valid();
    }
  }
  else
  {
    /* 예상하지 않은 OUT data나 너무 큰 packet은 control transfer 오류로 처리한다. */
    g_expect_out = 0U;
    ep0_stall();
  }
}

static void dfu_process_dnload(const uint8_t *buf, uint16_t len)
{
  uint32_t addr;

  /* 이미 DFU 오류 상태라면 새 데이터를 처리하지 않는다. host가 CLRSTATUS를 보내야 회복된다. */
  if (g_dfu_status != DFU_STATUS_OK)
  {
    return;
  }

  if (g_setup.wValue == 0U)
  {
    /*
     * DfuSe 프로토콜에서 block number 0은 명령 블록이다.
     * dfu-util은 여기로 SET_ADDRESS 또는 ERASE 명령을 먼저 보낸다.
     */
    if ((len >= 5U) && (buf[0] == DFUSE_CMD_SET_ADDRESS))
    {
      /* 이후 데이터 block이 기록될 기준 주소를 host가 지정한다. */
      addr = rd32(&buf[1]);
      if (address_allowed(addr, 1U) != 0U)
      {
        g_pending_dfu_addr = addr;
        g_pending_dfu_op = DFU_OP_SET_ADDRESS;
        g_dfu_state = DFU_STATE_DNLOAD_SYNC;
      }
      else
      {
        /* 앱 영역 밖 주소를 요구하면 부트로더 보호를 위해 오류 상태로 간다. */
        g_dfu_status = DFU_STATUS_ERR_ADDRESS;
        g_dfu_state = DFU_STATE_ERROR;
      }
    }
    else if ((len >= 5U) && (buf[0] == DFUSE_CMD_ERASE))
    {
      /* 페이지 삭제 주소만 예약하고 실제 삭제는 GETSTATUS 응답 뒤 메인 루프에서 수행한다. */
      addr = rd32(&buf[1]);
      if (address_allowed(addr, FLASH_PAGE_SIZE) != 0U)
      {
        g_pending_dfu_addr = addr;
        g_pending_dfu_op = DFU_OP_ERASE;
        g_dfu_state = DFU_STATE_DNLOAD_SYNC;
      }
      else
      {
        /* erase 실패는 write 오류로 보고 host에 알린다. */
        g_dfu_status = DFU_STATUS_ERR_WRITE;
        g_dfu_state = DFU_STATE_ERROR;
      }
    }
    else
    {
      /* 알 수 없는 block 0 명령은 최소 호환성을 위해 일단 성공 동기화로 넘긴다. */
      g_dfu_state = DFU_STATE_DNLOAD_SYNC;
    }
  }
  else if (g_setup.wValue >= 2U)
  {
    /*
     * DfuSe에서 실제 데이터 block은 block number 2부터 시작한다.
     * 주소 = SET_ADDRESS 기준 + (block number - 2) * transfer size.
     */
    addr = g_dfu_address + ((uint32_t)(g_setup.wValue - 2U) * DFU_XFER_SIZE);
    if (address_allowed(addr, len) != 0U)
    {
      /*
       * buf는 다음 DNLOAD까지 유지되는 g_ep0_out을 가리킨다.
       * 호스트는 GETSTATUS 완료 전 다음 block을 보내지 않으므로 예약 작업 동안 안전하다.
       */
      g_pending_dfu_addr = addr;
      g_pending_dfu_len = len;
      g_pending_dfu_op = DFU_OP_WRITE;
      g_dfu_state = DFU_STATE_DNLOAD_SYNC;
    }
    else
    {
      /* 범위 밖 기록이나 플래시 기록 실패는 DFU error 상태로 고정한다. */
      g_dfu_status = DFU_STATUS_ERR_WRITE;
      g_dfu_state = DFU_STATE_ERROR;
    }
  }
  else
  {
    /* block number 1은 이 최소 구현에서 특별히 쓰지 않는다. */
    g_dfu_state = DFU_STATE_DNLOAD_SYNC;
  }
}

static void dfu_run_pending(void)
{
  uint8_t op = g_pending_dfu_op;
  uint8_t ok = 1U;

