seabears/Stm32_Test/Bootloader_DFU_Min/Core/Src/main.c
  /*
   * 작업 시작 전에 예약을 비운다. 실행 중 USB reset/abort가 발생하더라도
   * 같은 페이지를 다시 실행하지 않도록 하기 위한 순서다.
   */
  g_pending_dfu_op = DFU_OP_NONE;
  g_pending_dfu_ready = 0U;

  if (op == DFU_OP_SET_ADDRESS)
  {
    g_dfu_address = g_pending_dfu_addr;
  }
  else if (op == DFU_OP_ERASE)
  {
    ok = flash_erase_page(g_pending_dfu_addr);
  }
  else if (op == DFU_OP_WRITE)
  {
    ok = flash_write(g_pending_dfu_addr, g_ep0_out, g_pending_dfu_len);
  }

  if (ok != 0U)
  {
    g_dfu_state = DFU_STATE_DNLOAD_IDLE;
  }
  else
  {
    g_dfu_status = DFU_STATUS_ERR_WRITE;
    g_dfu_state = DFU_STATE_ERROR;
  }
}

static void usb_tx_done(void)
{
  if (g_tx_len != 0U)
  {
    /* descriptor처럼 64바이트보다 긴 IN 응답은 EP0_SIZE 단위로 나눠서 계속 보낸다. */
    uint16_t chunk = min16(g_tx_len, EP0_SIZE);
    pma_write(EP0_TX_ADDR, g_tx_ptr, chunk);
    pma_set_u16(2U, chunk);
    g_tx_ptr += chunk;
    g_tx_len -= chunk;
    ep0_tx_status(USB_EP_TX_VALID);
  }
  else
  {
    /* SET_ADDRESS는 status stage가 끝난 지금 적용해야 USB 규격에 맞다. */
    if (g_pending_addr != 0U)
    {
      USB->DADDR = USB_DADDR_EF | g_pending_addr;
      g_pending_addr = 0U;
    }
    /* 다음 SETUP/OUT packet을 받을 수 있도록 EP0 RX를 다시 valid로 만든다. */
    ep0_rx_valid();
  }
}

static void ep0_send(const uint8_t *data, uint16_t len)
{
  /* 첫 packet을 PMA에 올리고, 남은 데이터는 usb_tx_done에서 이어 보낸다. */
  uint16_t chunk = min16(len, EP0_SIZE);
  g_tx_ptr = data + chunk;
  g_tx_len = len - chunk;
  pma_write(EP0_TX_ADDR, data, chunk);
  pma_set_u16(2U, chunk);
  ep0_rx_status(USB_EP_RX_VALID);
  ep0_tx_status(USB_EP_TX_VALID);
}

static void ep0_send_zlp(void)
{
  /* Zero Length Packet. 성공했지만 돌려줄 payload가 없을 때 status stage로 보낸다. */
  g_tx_ptr = 0;
  g_tx_len = 0U;
  pma_set_u16(2U, 0U);
  ep0_tx_status(USB_EP_TX_VALID);
  ep0_rx_status(USB_EP_RX_VALID);
}

static void ep0_stall(void)
{
  /* 지원하지 않거나 잘못된 control request는 양방향을 STALL로 막는다. */
  ep0_tx_status(USB_EP_TX_STALL);
  ep0_rx_status(USB_EP_RX_STALL);
}

static void ep0_rx_valid(void)
{
  /* host가 다음 OUT/SETUP packet을 보낼 수 있게 RX endpoint 상태를 VALID로 바꾼다. */
  ep0_rx_status(USB_EP_RX_VALID);
}

static void ep0_tx_status(uint16_t status)
{
  /*
   * STM32 USB EP register의 STAT_TX/STAT_RX 비트는 write-toggle 방식이다.
   * 원하는 상태와 현재 상태의 차이만 XOR로 토글해야 한다.
   */
  uint16_t epr = USB->EP0R;
  uint16_t r = epr & USB_EPREG_MASK;
  r |= USB_EP_CTR_RX | USB_EP_CTR_TX;
  r |= (uint16_t)((epr & USB_EPTX_STAT) ^ status);
  USB->EP0R = r;
}

static void ep0_rx_status(uint16_t status)
{
  /* RX 상태도 TX와 같은 toggle 규칙을 따른다. */
  uint16_t epr = USB->EP0R;
  uint16_t r = epr & USB_EPREG_MASK;
  r |= USB_EP_CTR_RX | USB_EP_CTR_TX;
  r |= (uint16_t)((epr & USB_EPRX_STAT) ^ status);
  USB->EP0R = r;
}

static void pma_write(uint16_t pma_addr, const uint8_t *src, uint16_t len)
{
  /*
   * USB PMA(packet memory area)에 byte 배열을 16비트 word로 복사한다.
   * F103 PMA는 일반 SRAM처럼 byte 접근하지 않고 전용 16비트 배치를 쓴다.
   */
  __IO uint16_t *p = (__IO uint16_t *)((uint32_t)USB + 0x400U + ((uint32_t)pma_addr * PMA_ACCESS));
  uint16_t i = 0U;
  while (i < len)
  {
    uint16_t v = src[i];
    if ((i + 1U) < len) { v |= ((uint16_t)src[i + 1U] << 8); }
    *p = v;
    p += PMA_ACCESS;
    i += 2U;
  }
}

static void pma_read(uint16_t pma_addr, uint8_t *dst, uint16_t len)
{
  /* PMA의 16비트 word를 다시 일반 byte 배열로 풀어서 읽는다. */
  __IO uint16_t *p = (__IO uint16_t *)((uint32_t)USB + 0x400U + ((uint32_t)pma_addr * PMA_ACCESS));
  uint16_t i = 0U;
  while (i < len)
  {
    uint16_t v = *p;
    dst[i] = (uint8_t)v;
    if ((i + 1U) < len) { dst[i + 1U] = (uint8_t)(v >> 8); }
    p += PMA_ACCESS;
    i += 2U;
  }
}

static void pma_set_u16(uint16_t offset, uint16_t value)
{
  /* BTABLE entry나 count register처럼 PMA 안의 16비트 값을 직접 쓴다. */
  *(__IO uint16_t *)((uint32_t)USB + 0x400U + ((uint32_t)offset * PMA_ACCESS)) = value;
}

static uint16_t pma_get_u16(uint16_t offset)
{
  /* BTABLE entry나 count register처럼 PMA 안의 16비트 값을 직접 읽는다. */
  return *(__IO uint16_t *)((uint32_t)USB + 0x400U + ((uint32_t)offset * PMA_ACCESS));
}

static void flash_unlock(void)
{
  /* STM32 내부 플래시는 lock 상태가 기본이므로 KEY1/KEY2를 순서대로 써서 해제한다. */
  if ((FLASH->CR & FLASH_CR_LOCK) != 0U)
  {
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;
  }
}

static void flash_lock(void)
{
  /* erase/write가 끝나면 다시 lock해서 실수로 플래시가 바뀌지 않게 한다. */
  FLASH->CR |= FLASH_CR_LOCK;
}

static void flash_wait(void)
{
  /* 플래시 erase/write 진행 중에는 BSY가 내려갈 때까지 기다린다. */
  while ((FLASH->SR & FLASH_SR_BSY) != 0U) {}
}

static void flash_clear_flags(void)
{
  /* 이전 작업의 완료/오류 플래그를 지워 새 작업 결과만 판단한다. */
  FLASH->SR = FLASH_SR_EOP | FLASH_SR_PGERR | FLASH_SR_WRPRTERR;
}

static uint8_t flash_erase_page(uint32_t addr)
{
  /* 어떤 주소가 들어와도 그 주소가 속한 1 KiB 페이지 시작 주소로 맞춘다. */
  addr -= (addr % FLASH_PAGE_SIZE);
  /* 페이지 erase 시퀀스: unlock -> wait -> flag clear -> PER -> AR -> STRT. */
  flash_unlock();
  flash_wait();
  flash_clear_flags();
  FLASH->CR |= FLASH_CR_PER;
  FLASH->AR = addr;
  FLASH->CR |= FLASH_CR_STRT;
  flash_wait();
  FLASH->CR &= ~FLASH_CR_PER;
  flash_lock();
  /* 프로그래밍/쓰기 보호 오류가 없으면 성공. */
  return ((FLASH->SR & (FLASH_SR_PGERR | FLASH_SR_WRPRTERR)) == 0U) ? 1U : 0U;
}

static uint8_t flash_write(uint32_t addr, const uint8_t *src, uint16_t len)
{
  uint16_t i = 0U;
  /*
   * STM32F1 플래시는 half-word(16비트) 단위로 program한다.
   * dfu-util 데이터 길이가 홀수일 수 있으므로 마지막 상위 바이트는 0xFF로 채운다.
   */
  flash_unlock();
  while (i < len)
  {
    uint16_t v = src[i];
    if ((i + 1U) < len) { v |= ((uint16_t)src[i + 1U] << 8); }
    else { v |= 0xFF00U; }
    flash_wait();
    flash_clear_flags();
    /* PG 비트를 켠 뒤 대상 주소에 half-word를 쓰면 플래시 program이 시작된다. */
    FLASH->CR |= FLASH_CR_PG;
    *(__IO uint16_t *)(addr + i) = v;
    flash_wait();
    FLASH->CR &= ~FLASH_CR_PG;
    /* 오류 플래그 또는 read-back 불일치가 있으면 실패로 처리한다. */
    if (((FLASH->SR & (FLASH_SR_PGERR | FLASH_SR_WRPRTERR)) != 0U) || (*(__IO uint16_t *)(addr + i) != v))
    {
      flash_lock();
      return 0U;
    }
    i += 2U;
  }
  flash_lock();
  return 1U;
}

static uint8_t address_allowed(uint32_t addr, uint32_t len)
{
  /* 앱 시작 주소보다 낮은 쓰기는 부트로더 영역을 덮을 수 있으므로 금지한다. */
  if (addr < APP_ADDRESS) { return 0U; }
  /* 플래시 끝을 넘어가는 시작 주소도 금지한다. */
  if (addr >= FLASH_END_ADDRESS) { return 0U; }
  /* 시작 주소는 정상이어도 길이까지 더했을 때 플래시 끝을 넘으면 금지한다. */
  if (len > (FLASH_END_ADDRESS - addr)) { return 0U; }
  return 1U;
}

static uint8_t app_valid(void)
{
  /*
   * Cortex-M 벡터 테이블의 첫 word는 초기 SP, 두 번째 word는 Reset_Handler다.
   * SP가 SRAM 범위이고 PC가 앱 플래시 범위이면 앱이 있다고 판단한다.
   */
  uint32_t sp = *(__IO uint32_t *)APP_ADDRESS;
  uint32_t pc = *(__IO uint32_t *)(APP_ADDRESS + 4U);
  return ((sp >= SRAM_START) && (sp <= SRAM_END) && (pc >= APP_ADDRESS) && (pc < FLASH_END_ADDRESS)) ? 1U : 0U;
}

static void jump_app(void)
{
  /* 앱 벡터 테이블에서 초기 stack pointer와 reset handler 주소를 가져온다. */
  uint32_t sp = *(__IO uint32_t *)APP_ADDRESS;
  uint32_t pc = *(__IO uint32_t *)(APP_ADDRESS + 4U);
  entry_fn_t app = (entry_fn_t)pc;
  /* 점프 중 interrupt가 끼어들지 않도록 잠깐 막는다. */
  __disable_irq();
  /* 부트로더가 쓰던 USB peripheral과 SysTick을 정리한다. */
  USB->CNTR = USB_CNTR_FRES | USB_CNTR_PDWN;
  RCC->APB1ENR &= ~RCC_APB1ENR_USBEN;
  SysTick->CTRL = 0U;
  /* interrupt vector base를 앱 시작 주소로 바꾼다. */
  SCB->VTOR = APP_ADDRESS;
  /* MSP를 앱의 초기 stack pointer로 바꾼 뒤 앱 Reset_Handler를 호출한다. */
  __set_MSP(sp);
  __enable_irq();
  app();
}


static uint16_t min16(uint16_t a, uint16_t b)
{
  /* EP0 packet 나누기용 작은 min 함수. 표준 라이브러리 의존을 줄이기 위해 직접 둔다. */
  return (a < b) ? a : b;
}

static uint32_t rd32(const uint8_t *p)
{
  /* DfuSe 명령 payload의 little-endian 32비트 주소를 읽는다. */
  return ((uint32_t)p[0]) | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}
